betfair/templates/global/BFGlobalService.withdrawByBankTransfer.req.xml

<?xmlversion='1.0'encoding='UTF-8'?>
<SOAP-ENV:Envelope
xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/'
xmlns:SOAP-ENC='http://schemas.xmlsoap.org/soap/encoding/'
xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
xmlns:xsd='http://www.w3.org/2001/XMLSchema'
xmlns:ns2='http://www.betfair.com/publicapi/types/global/v3/'
xmlns:ns1='http://www.betfair.com/publicapi/v3/BFGlobalService/'>
<SOAP-ENV:Body>
<ns1:withdrawByBankTransfer>
<ns1:request>
<header>
<sessionToken></sessionToken>
</header>
<mode>VALIDATE</mode>
<amount>0.0</amount>
<bankAccountDetails>
<payee></payee>
<accountType>NotSpecified</accountType>
<bankKey></bankKey>
<routing></routing>
<abiCab></abiCab>
<bankName></bankName>
<accountHoldingBranch></accountHoldingBranch>
<bankGiroCreditNumber></bankGiroCreditNumber>
<accountNumber></accountNumber>
<sortCode></sortCode>
<bankCode></bankCode>
<blzCode></blzCode>
<bankBsb></bankBsb>
<branchCode></branchCode>
<bankLocationIso3></bankLocationIso3>
</bankAccountDetails>
<expressTransfer>false</expressTransfer>
<password></password>
<header>
<clientStamp>0</clientStamp>
<sessionToken></sessionToken>
</header>
</ns1:request>
</ns1:withdrawByBankTransfer>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
